Autodesk.Revit.DB.BuiltInFailures.ZoneFailures.ZonesOverlapWarning
Zone overlap to another zone or another room.

Autodesk.Revit.DB.BuiltInFailures.ZoneFailures.ZoneNotEnclosed
Zone not enclosed totally.

Autodesk.Revit.DB.BuiltInFailures.ZoneFailures.ZoneExistsNotEnclosedRoom
Zone has a room not enclosed.

Autodesk.Revit.DB.BuiltInFailures.ZoneFailures
Failures about Zone.